#include "ds1302.h"


//---DS1302写入和读取时分秒的地址命令---//
//---秒分时日月周年 最低位读写位;-------//
uchar code READ_RTC_ADDR[7] = {0x81, 0x83, 0x85, 0x87, 0x89, 0x8b, 0x8d}; 
uchar code WRITE_RTC_ADDR[7] = {0x80, 0x82, 0x84, 0x86, 0x88, 0x8a, 0x8c};

//---DS1302时钟初始化2020年1月13日星期一21点30分00秒---//
//---存储顺序是秒分时日月周年,存储格式是用BCD码---//
uchar TIME0[7] = {0, 0x30, 0x21, 0x13, 0x01, 0x01, 0x20};


/********************************Hy*************************************/
uchar changeto_BCD(uint sg)   //将普通数据:sg 转换成BCD:a
{
 uint a,b;
  a=sg/10;
  b=sg%10;
  a=a&0xff;
  b=b&0xff;
  a<<=4;
  a=a|b;
 return (a);
}

uint changeto_putong(uchar a)   //将BCD:a 转换成普通数据:sg
{
	uint sg;
	sg=(a/16)*10+a%16;
	return sg;
}
/********************************Hy*************************************/


/*******************************************************************************
* 函 数 名         : Ds1302Write
* 函数功能		   : 向DS1302命令（地址+数据）
* 输    入         : addr,dat
* 输    出         : 无
*******************************************************************************/
void Ds1302Write(uchar addr, uchar dat)
{
	uchar n;
	RST = 0;
	_nop_();

	SCLK = 0;//先将SCLK置低电平。
	_nop_();
	RST = 1; //然后将RST(CE)置高电平。
	_nop_();

	for (n=0; n<8; n++)//开始传送八位地址命令
	{
		DSIO = addr & 0x01;//数据从低位开始传送
		addr >>= 1;
		SCLK = 1;//数据在上升沿时，DS1302读取数据
		_nop_();
		SCLK = 0;
		_nop_();
	}
	for (n=0; n<8; n++)//写入8位数据
	{
		DSIO = dat & 0x01;
		dat >>= 1;
		SCLK = 1;//数据在上升沿时，DS1302读取数据
		_nop_();
		SCLK = 0;
		_nop_();	
	}	
		 
	RST = 0;//传送数据结束
	_nop_();
}


/*******************************************************************************
* 函 数 名         : Ds1302Read
* 函数功能		   : 读取一个地址的数据
* 输    入         : addr
* 输    出         : dat
*******************************************************************************/
uchar Ds1302Read(uchar addr)
{
	uchar n,dat,dat1;
	RST = 0;
	_nop_();

	SCLK = 0;//先将SCLK置低电平。
	_nop_();
	RST = 1;//然后将RST(CE)置高电平。
	_nop_();

	for(n=0; n<8; n++)//开始传送八位地址命令
	{
		DSIO = addr & 0x01;//数据从低位开始传送
		addr >>= 1;
		SCLK = 1;//数据在上升沿时，DS1302读取数据
		_nop_();
		SCLK = 0;//DS1302下降沿时，放置数据
		_nop_();
	}
	_nop_();
	for(n=0; n<8; n++)//读取8位数据
	{
		dat1 = DSIO;//从最低位开始接收
		dat = (dat>>1) | (dat1<<7);
		SCLK = 1;
		_nop_();
		SCLK = 0;//DS1302下降沿时，放置数据
		_nop_();
	}

	RST = 0;
	_nop_();	//以下为DS1302复位的稳定时间,必须的。
	SCLK = 1;
	_nop_();
	DSIO = 0;
	_nop_();
	DSIO = 1;
	_nop_();
	return dat;	
}


/*******************************************************************************
* 函 数 名         : Ds1302Init
* 函数功能		   : 初始化DS1302.
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Ds1302Init()
{
	uchar n;
	
/***********Hy*************/
	TIME[5]++;//因星期计算函数week_proc()输出星期是0-6，而DS1302星期寄存器值1-7，所以需补偿+1//TIME[5]-week
	for(n=0;n<7;n++)//依次变换赋值 秒分时日月周年
	{
		TIME0[n]=changeto_BCD(TIME[n]);
	}
/***********Hy*************/
	
	Ds1302Write(0x8E,0X00);		 //禁止写保护，就是关闭写保护功能
	for (n=0; n<7; n++)//写入7个字节的时钟信号：秒分时日月周年
	{
		Ds1302Write(WRITE_RTC_ADDR[n],TIME0[n]);	
	}
	Ds1302Write(0x8E,0x80);		 //打开写保护功能
	
/***********Hy*************///没更新前星期TIME[5]-week还是被补偿+1却没有恢复-1的状态，只有更新后显示才不会出现错误
	Ds1302ReadTime();
/***********Hy*************///虽然在定时器0已有此更新语句，但间隔1S较长，所以最好写完时间后就马上在此更新
}

/*******************************************************************************
* 函 数 名         : Ds1302ReadTime
* 函数功能		   : 读取时钟信息
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Ds1302ReadTime()
{
	uchar n;

	for (n=0; n<7; n++)//读取7个字节的时钟信号：秒分时日月周年
	{
		TIME0[n] = Ds1302Read(READ_RTC_ADDR[n]);
	}
	
/***********Hy*************/
	for(n=0;n<7;n++)//依次变换赋值时分秒
	{
		TIME[n]=changeto_putong(TIME0[n]);
	}
	TIME[5]--;//因星期计算函数week_proc()输出星期是0-6，而DS1302星期寄存器值1-7，所以被补偿值返回后需恢复-1//TIME[5]-week
/***********Hy*************/	
}


/*************************************Hy*****************************************/
void charge_off()//关闭涓流充电
{
	Ds1302Write(0x8E,0X00);		 //禁止写保护，就是关闭写保护功能
	
	Ds1302Write(0x90,0x00);	//关闭涓流充电
	
	Ds1302Write(0x8E,0x80);		 //打开写保护功能
}
/**************************************Hy****************************************/
